IF NOT EXISTS (SELECT* FROM Students WHERE Surname in ('Бунша', 'Бендер', 'Тимофеев', 'Чапаев', 'Петров'))

INSERT INTO dbo.Students (User_id, Name,Surname,Exam_score,code_id)
values (1, 'Иван', 'Бунша', 220, 1),
       (2, 'Остап', 'Бендер', 170, 2),
	   (3,'Александр', 'Тимофеев', 300, 3),
	   (4, 'Василий','Чапаев', 210, 1),
       (5,'Петр','Петров', 300, 2),
	   (4,'Василий','Чапаев', 310, 2),
	   (2,'Остап', 'Бендер', 190, 1),
	   (1, 'Иван', 'Бунша', 230, 2),
	   (5,'Александр', 'Тимофеев', 180, 1)
GO		   